reports/benchmark/inspur_MetaX_C550/GLM-5-W8A8/test_03/01/64-1000-i90000-o2000/bench-test_03-64-1000-i90000-o2000.log
Skipping import of cpp extensions due to incompatible torch version 2.8.0+metax3.5.3.9 for torchao version 0.15.0             Please see https://github.com/pytorch/ao/issues/2919 for more info
/opt/conda/lib/python3.10/site-packages/torchvision/datapoints/__init__.py:12: UserWarning: The torchvision.datapoints and torchvision.transforms.v2 namespaces are still Beta. While we do not expect major breaking changes, some APIs may still change according to user feedback. Please submit any feedback you may have in this issue: https://github.com/pytorch/vision/issues/6753, and you can also check out https://github.com/pytorch/vision/issues/7319 to learn more about the APIs that we suspect might involve future changes. You can silence this warning by calling torchvision.disable_beta_transforms_warning().
  warnings.warn(_BETA_TRANSFORMS_WARNING)
/opt/conda/lib/python3.10/site-packages/torchvision/transforms/v2/__init__.py:54: UserWarning: The torchvision.datapoints and torchvision.transforms.v2 namespaces are still Beta. While we do not expect major breaking changes, some APIs may still change according to user feedback. Please submit any feedback you may have in this issue: https://github.com/pytorch/vision/issues/6753, and you can also check out https://github.com/pytorch/vision/issues/7319 to learn more about the APIs that we suspect might involve future changes. You can silence this warning by calling torchvision.disable_beta_transforms_warning().
  warnings.warn(_BETA_TRANSFORMS_WARNING)
benchmark_args=Namespace(backend='sglang', base_url=None, host='0.0.0.0', port=8000, dataset_name='random', dataset_path='/home/workspace/ShareGPT_V3_unfiltered_cleaned_split.json', model='/var_docker/data_shared/GLM-5-W8A8', served_model_name=None, tokenizer=None, num_prompts=1000, sharegpt_output_len=None, sharegpt_context_len=None, random_input_len=90000, random_output_len=2000, random_range_ratio=1.0, image_count=1, image_resolution='1080p', random_image_count=False, image_format='jpeg', image_content='random', request_rate=inf, use_trace_timestamps=False, max_concurrency=64, output_file='reports/benchmark/inspur_MetaX_C550/GLM-5-W8A8/test_03/01/64-1000-i90000-o2000/bench-test_03-64-1000-i90000-o2000.jsonl', output_details=False, print_requests=False, disable_tqdm=False, disable_stream=False, return_logprob=False, return_routed_experts=False, seed=1, disable_ignore_eos=False, extra_request_body=None, apply_chat_template=False, profile=False, plot_throughput=False, profile_activities=['CPU', 'GPU'], profile_num_steps=None, profile_by_stage=False, profile_stages=None, profile_output_dir=None, profile_prefix=None, lora_name=None, lora_request_distribution='uniform', lora_zipf_alpha=1.5, prompt_suffix='', pd_separated=False, profile_prefill_url=None, profile_decode_url=None, flush_cache=False, warmup_requests=1, tokenize_prompt=False, gsp_num_groups=64, gsp_prompts_per_group=16, gsp_system_prompt_len=2048, gsp_question_len=128, gsp_output_len=256, gsp_range_ratio=1.0, gsp_fast_prepare=False, gsp_send_routing_key=False, gsp_num_turns=1, gsp_ordered=False, mooncake_slowdown_factor=1.0, mooncake_num_rounds=1, mooncake_workload='conversation', tag=None, header=None, rampup_mode=False, ramp_up_period=0.0)
Namespace(backend='sglang', base_url=None, host='0.0.0.0', port=8000, dataset_name='random', dataset_path='/home/workspace/ShareGPT_V3_unfiltered_cleaned_split.json', model='/var_docker/data_shared/GLM-5-W8A8', served_model_name=None, tokenizer=None, num_prompts=1000, sharegpt_output_len=None, sharegpt_context_len=None, random_input_len=90000, random_output_len=2000, random_range_ratio=1.0, image_count=1, image_resolution='1080p', random_image_count=False, image_format='jpeg', image_content='random', request_rate=inf, use_trace_timestamps=False, max_concurrency=64, output_file='reports/benchmark/inspur_MetaX_C550/GLM-5-W8A8/test_03/01/64-1000-i90000-o2000/bench-test_03-64-1000-i90000-o2000.jsonl', output_details=False, print_requests=False, disable_tqdm=False, disable_stream=False, return_logprob=False, return_routed_experts=False, seed=1, disable_ignore_eos=False, extra_request_body=None, apply_chat_template=False, profile=False, plot_throughput=False, profile_activities=['CPU', 'GPU'], profile_num_steps=None, profile_by_stage=False, profile_stages=None, profile_output_dir=None, profile_prefix=None, lora_name=None, lora_request_distribution='uniform', lora_zipf_alpha=1.5, prompt_suffix='', pd_separated=False, profile_prefill_url=None, profile_decode_url=None, flush_cache=False, warmup_requests=1, tokenize_prompt=False, gsp_num_groups=64, gsp_prompts_per_group=16, gsp_system_prompt_len=2048, gsp_question_len=128, gsp_output_len=256, gsp_range_ratio=1.0, gsp_fast_prepare=False, gsp_send_routing_key=False, gsp_num_turns=1, gsp_ordered=False, mooncake_slowdown_factor=1.0, mooncake_num_rounds=1, mooncake_workload='conversation', tag=None, header=None, rampup_mode=False, ramp_up_period=0.0)

#Input tokens: 90000000
#Output tokens: 2000000
Starting warmup with 1 sequences...
Warmup completed with 1 sequences. Starting main benchmark run...

  0%|          | 0/1000 [00:00<?, ?it/s]
  0%|          | 1/1000 [00:10<2:50:18, 10.23s/it]
  0%|          | 5/1000 [00:10<25:48,  1.56s/it]  
  1%|          | 8/1000 [00:10<15:02,  1.10it/s]
  1%|          | 10/1000 [00:11<11:33,  1.43it/s]
  1%|▏         | 13/1000 [00:11<07:16,  2.26it/s]
  2%|▏         | 15/1000 [00:12<06:41,  2.45it/s]
  2%|▏         | 16/1000 [00:12<06:05,  2.69it/s]
  2%|▏         | 17/1000 [00:12<05:27,  3.00it/s]
  2%|▏         | 19/1000 [00:12<04:34,  3.57it/s]
  2%|▏         | 21/1000 [00:13<03:31,  4.63it/s]
  2%|▏         | 22/1000 [00:13<03:24,  4.79it/s]
  2%|▏         | 23/1000 [00:13<03:45,  4.34it/s]
  2%|▏         | 24/1000 [00:13<03:27,  4.70it/s]
  2%|▎         | 25/1000 [00:13<03:12,  5.08it/s]
  3%|▎         | 27/1000 [00:14<02:30,  6.46it/s]
  3%|▎         | 28/1000 [00:14<02:29,  6.52it/s]
  3%|▎         | 30/1000 [00:14<02:29,  6.47it/s]
  3%|▎         | 32/1000 [00:14<02:27,  6.55it/s]
  3%|▎         | 33/1000 [00:15<03:03,  5.28it/s]
  3%|▎         | 34/1000 [00:15<02:58,  5.41it/s]
  4%|▎         | 36/1000 [00:15<02:54,  5.51it/s]
  4%|▎         | 37/1000 [00:15<02:50,  5.66it/s]
  4%|▍         | 39/1000 [00:16<03:20,  4.79it/s]
  4%|▍         | 43/1000 [00:16<02:15,  7.06it/s]
  4%|▍         | 45/1000 [00:17<02:19,  6.83it/s]
  5%|▍         | 46/1000 [00:17<02:18,  6.88it/s]
  5%|▍         | 47/1000 [00:17<03:18,  4.80it/s]
  5%|▌         | 50/1000 [00:17<02:12,  7.18it/s]
  5%|▌         | 52/1000 [00:18<01:55,  8.17it/s]
  5%|▌         | 54/1000 [00:18<03:00,  5.23it/s]
  6%|▌         | 55/1000 [00:19<03:21,  4.69it/s]
  6%|▌         | 58/1000 [00:19<02:15,  6.93it/s]
  6%|▌         | 60/1000 [00:19<01:52,  8.33it/s]
  6%|▌         | 62/1000 [00:19<02:47,  5.60it/s]
  6%|▋         | 63/1000 [00:20<02:50,  5.51it/s]
  6%|▋         | 64/1000 [00:20<03:13,  4.82it/s]
  7%|▋         | 67/1000 [00:20<02:07,  7.32it/s]
  7%|▋         | 69/1000 [00:20<01:50,  8.45it/s]
  7%|▋         | 71/1000 [00:21<02:45,  5.62it/s]
  7%|▋         | 72/1000 [00:21<02:42,  5.71it/s]
  7%|▋         | 73/1000 [00:21<02:41,  5.75it/s]
  8%|▊         | 75/1000 [00:22<03:05,  4.97it/s]
  8%|▊         | 79/1000 [00:22<01:53,  8.14it/s]
  8%|▊         | 81/1000 [00:23<02:37,  5.85it/s]
  8%|▊         | 82/1000 [00:23<02:31,  6.07it/s]
  8%|▊         | 83/1000 [00:23<02:27,  6.21it/s]
  8%|▊         | 84/1000 [00:23<02:24,  6.32it/s]
  9%|▊         | 87/1000 [00:23<01:41,  8.96it/s]
  9%|▉         | 89/1000 [00:24<02:19,  6.54it/s]
  9%|▉         | 90/1000 [00:24<03:10,  4.77it/s]
  9%|▉         | 93/1000 [00:24<02:07,  7.12it/s]
 10%|▉         | 95/1000 [00:25<02:19,  6.51it/s]
 10%|▉         | 97/1000 [00:25<02:25,  6.22it/s]
 10%|▉         | 99/1000 [00:26<03:12,  4.67it/s]
 10%|█         | 101/1000 [00:26<02:39,  5.63it/s]
 10%|█         | 103/1000 [00:26<02:13,  6.74it/s]
 10%|█         | 105/1000 [00:26<01:54,  7.85it/s]
 11%|█         | 107/1000 [00:27<02:38,  5.63it/s]
 11%|█         | 108/1000 [00:27<02:35,  5.73it/s]
 11%|█         | 110/1000 [00:27<02:06,  7.05it/s]
 11%|█         | 111/1000 [00:27<02:36,  5.67it/s]
 11%|█         | 112/1000 [00:28<02:37,  5.64it/s]
 11%|█▏        | 113/1000 [00:28<02:42,  5.46it/s]
 11%|█▏        | 114/1000 [00:28<02:39,  5.54it/s]
 12%|█▏        | 115/1000 [00:28<02:38,  5.59it/s]
 12%|█▏        | 116/1000 [00:28<02:33,  5.75it/s]
 12%|█▏        | 118/1000 [00:28<01:55,  7.66it/s]
 12%|█▏        | 119/1000 [00:29<02:01,  7.25it/s]
 12%|█▏        | 120/1000 [00:29<02:41,  5.46it/s]
 12%|█▏        | 121/1000 [00:29<02:32,  5.78it/s]
 12%|█▏        | 123/1000 [00:29<01:56,  7.54it/s]
 12%|█▏        | 124/1000 [00:30<02:34,  5.68it/s]
 12%|█▎        | 125/1000 [00:30<02:37,  5.57it/s]
 13%|█▎        | 127/1000 [00:30<02:00,  7.26it/s]
 13%|█▎        | 129/1000 [00:30<01:43,  8.38it/s]
 13%|█▎        | 130/1000 [00:30<02:16,  6.35it/s]
 13%|█▎        | 131/1000 [00:31<02:56,  4.93it/s]
 13%|█▎        | 132/1000 [00:31<02:58,  4.86it/s]
 13%|█▎        | 133/1000 [00:31<03:18,  4.36it/s]
 14%|█▍        | 138/1000 [00:31<01:28,  9.74it/s]
 14%|█▍        | 140/1000 [00:32<02:29,  5.74it/s]
 14%|█▍        | 141/1000 [00:32<02:31,  5.69it/s]
 14%|█▍        | 142/1000 [00:32<02:30,  5.69it/s]
 14%|█▍        | 144/1000 [00:33<02:05,  6.82it/s]
 14%|█▍        | 145/1000 [00:33<02:08,  6.67it/s]
 15%|█▍        | 146/1000 [00:33<02:15,  6.28it/s]
 15%|█▍        | 147/1000 [00:33<02:53,  4.92it/s]
 15%|█▍        | 148/1000 [00:33<02:35,  5.47it/s]
 15%|█▍        | 149/1000 [00:34<02:30,  5.66it/s]
 15%|█▌        | 150/1000 [00:34<02:27,  5.75it/s]
 15%|█▌        | 152/1000 [00:34<01:41,  8.37it/s]
 15%|█▌        | 154/1000 [00:34<01:48,  7.83it/s]
 16%|█▌        | 155/1000 [00:34<01:49,  7.70it/s]
 16%|█▌        | 156/1000 [00:35<03:03,  4.60it/s]
 16%|█▌        | 159/1000 [00:35<01:50,  7.63it/s]
 16%|█▌        | 161/1000 [00:35<01:39,  8.41it/s]
 16%|█▋        | 163/1000 [00:36<02:27,  5.66it/s]
 16%|█▋        | 164/1000 [00:36<02:54,  4.80it/s]
 17%|█▋        | 167/1000 [00:36<01:56,  7.15it/s]
 17%|█▋        | 169/1000 [00:36<01:41,  8.15it/s]
 17%|█▋        | 171/1000 [00:37<02:25,  5.70it/s]
 17%|█▋        | 172/1000 [00:37<02:44,  5.05it/s]
 18%|█▊        | 175/1000 [00:38<02:12,  6.20it/s]
 18%|█▊        | 176/1000 [00:38<02:10,  6.33it/s]
 18%|█▊        | 178/1000 [00:38<01:48,  7.55it/s]
 18%|█▊        | 179/1000 [00:38<01:55,  7.12it/s]
 18%|█▊        | 180/1000 [00:38<01:58,  6.91it/s]
 18%|█▊        | 181/1000 [00:39<02:34,  5.29it/s]
 18%|█▊        | 183/1000 [00:39<01:59,  6.83it/s]
 18%|█▊        | 184/1000 [00:39<02:01,  6.74it/s]
 18%|█▊        | 185/1000 [00:39<02:54,  4.68it/s]
 19%|█▊        | 187/1000 [00:40<02:05,  6.46it/s]
 19%|█▉        | 189/1000 [00:40<01:39,  8.12it/s]
 19%|█▉        | 192/1000 [00:40<02:29,  5.39it/s]
 19%|█▉        | 194/1000 [00:41<02:05,  6.44it/s]
 20%|█▉        | 196/1000 [00:41<01:42,  7.88it/s]
 20%|█▉        | 198/1000 [00:41<02:05,  6.37it/s]
 20%|██        | 200/1000 [00:41<01:41,  7.90it/s]
 20%|██        | 202/1000 [00:42<01:49,  7.26it/s]
 20%|██        | 204/1000 [00:42<02:28,  5.35it/s]
 21%|██        | 207/1000 [00:43<02:03,  6.40it/s]
 21%|██        | 208/1000 [00:43<02:06,  6.25it/s]
 21%|██        | 210/1000 [00:43<01:48,  7.25it/s]
 21%|██        | 212/1000 [00:43<01:34,  8.37it/s]
 21%|██▏       | 213/1000 [00:43<01:39,  7.91it/s]
 21%|██▏       | 214/1000 [00:44<02:09,  6.05it/s]
 22%|██▏       | 215/1000 [00:44<02:09,  6.07it/s]
 22%|██▏       | 216/1000 [00:44<02:39,  4.90it/s]
 22%|██▏       | 218/1000 [00:44<01:58,  6.61it/s]
 22%|██▏       | 219/1000 [00:45<02:55,  4.45it/s]
 22%|██▏       | 222/1000 [00:45<01:49,  7.10it/s]
 22%|██▏       | 223/1000 [00:45<01:51,  6.99it/s]
 22%|██▎       | 225/1000 [00:45<01:44,  7.40it/s]
 23%|██▎       | 226/1000 [00:46<02:15,  5.71it/s]
 23%|██▎       | 227/1000 [00:46<02:17,  5.62it/s]
 23%|██▎       | 228/1000 [00:46<02:12,  5.84it/s]
 23%|██▎       | 229/1000 [00:46<02:05,  6.16it/s]
 23%|██▎       | 232/1000 [00:46<01:20,  9.57it/s]
 23%|██▎       | 234/1000 [00:47<01:50,  6.96it/s]
 24%|██▎       | 235/1000 [00:47<01:56,  6.54it/s]
 24%|██▎       | 236/1000 [00:47<02:48,  4.54it/s]
 24%|██▍       | 239/1000 [00:47<01:50,  6.88it/s]
 24%|██▍       | 241/1000 [00:48<01:37,  7.75it/s]
 24%|██▍       | 242/1000 [00:48<02:27,  5.13it/s]
 24%|██▍       | 243/1000 [00:48<02:19,  5.44it/s]
 24%|██▍       | 244/1000 [00:48<02:11,  5.74it/s]
 24%|██▍       | 245/1000 [00:49<02:11,  5.73it/s]
 25%|██▍       | 246/1000 [00:49<02:08,  5.85it/s]
 25%|██▌       | 250/1000 [00:49<01:43,  7.25it/s]
 25%|██▌       | 251/1000 [00:50<02:02,  6.10it/s]
 25%|██▌       | 252/1000 [00:50<02:26,  5.12it/s]
 26%|██▌       | 255/1000 [00:50<01:36,  7.72it/s]
 26%|██▌       | 258/1000 [00:50<01:25,  8.69it/s]
 26%|██▌       | 260/1000 [00:51<01:50,  6.72it/s]
 26%|██▌       | 261/1000 [00:51<02:06,  5.85it/s]
 26%|██▌       | 262/1000 [00:51<02:04,  5.95it/s]
 26%|██▋       | 263/1000 [00:51<02:01,  6.05it/s]
 26%|██▋       | 264/1000 [00:52<02:00,  6.08it/s]
 26%|██▋       | 265/1000 [00:52<01:58,  6.18it/s]
 27%|██▋       | 268/1000 [00:52<01:18,  9.34it/s]
 27%|██▋       | 269/1000 [00:52<01:27,  8.36it/s]
 27%|██▋       | 270/1000 [00:52<01:34,  7.73it/s]
 27%|██▋       | 271/1000 [00:53<03:11,  3.81it/s]
 28%|██▊       | 276/1000 [00:53<01:38,  7.36it/s]
 28%|██▊       | 278/1000 [00:54<02:01,  5.94it/s]
 28%|██▊       | 280/1000 [00:54<02:31,  4.74it/s]
 28%|██▊       | 284/1000 [00:55<01:37,  7.38it/s]
 29%|██▊       | 286/1000 [00:55<02:10,  5.45it/s]
 29%|██▊       | 287/1000 [00:55<02:07,  5.59it/s]
 29%|██▉       | 288/1000 [00:56<02:08,  5.55it/s]
 29%|██▉       | 289/1000 [00:56<02:06,  5.64it/s]
 29%|██▉       | 291/1000 [00:56<01:37,  7.29it/s]
 29%|██▉       | 292/1000 [00:56<01:39,  7.09it/s]
 29%|██▉       | 293/1000 [00:56<01:41,  6.95it/s]
 29%|██▉       | 294/1000 [00:56<02:15,  5.20it/s]
 30%|██▉       | 296/1000 [00:57<02:24,  4.88it/s]
 30%|██▉       | 298/1000 [00:57<01:51,  6.27it/s]
 30%|███       | 300/1000 [00:57<01:31,  7.62it/s]
 30%|███       | 302/1000 [00:57<01:18,  8.86it/s]
 30%|███       | 304/1000 [00:58<02:08,  5.40it/s]
 31%|███       | 307/1000 [00:58<01:32,  7.49it/s]
 31%|███       | 310/1000 [00:59<01:50,  6.26it/s]
 31%|███       | 311/1000 [00:59<02:04,  5.53it/s]
 31%|███       | 312/1000 [00:59<02:02,  5.64it/s]
 31%|███▏      | 313/1000 [00:59<01:57,  5.83it/s]
 32%|███▏      | 315/1000 [01:00<01:37,  7.03it/s]
 32%|███▏      | 317/1000 [01:00<01:22,  8.31it/s]
 32%|███▏      | 318/1000 [01:00<02:01,  5.60it/s]
 32%|███▏      | 320/1000 [01:01<01:59,  5.70it/s]
 32%|███▏      | 321/1000 [01:01<01:51,  6.11it/s]
 32%|███▏      | 323/1000 [01:01<01:34,  7.19it/s]
 32%|███▏      | 324/1000 [01:01<01:35,  7.07it/s]
 32%|███▎      | 325/1000 [01:01<01:38,  6.88it/s]
 33%|███▎      | 326/1000 [01:01<02:06,  5.32it/s]
 33%|███▎      | 327/1000 [01:02<01:58,  5.67it/s]
 33%|███▎      | 328/1000 [01:02<01:50,  6.08it/s]
 33%|███▎      | 329/1000 [01:02<01:41,  6.61it/s]
 33%|███▎      | 332/1000 [01:02<01:08,  9.72it/s]
 33%|███▎      | 333/1000 [01:03<02:02,  5.44it/s]
 33%|███▎      | 334/1000 [01:03<02:17,  4.85it/s]
 34%|███▎      | 337/1000 [01:03<01:25,  7.78it/s]
 34%|███▍      | 339/1000 [01:03<01:29,  7.40it/s]
 34%|███▍      | 340/1000 [01:04<01:59,  5.53it/s]
 34%|███▍      | 341/1000 [01:04<01:55,  5.72it/s]
 34%|███▍      | 343/1000 [01:04<01:51,  5.87it/s]
 34%|███▍      | 344/1000 [01:04<01:48,  6.06it/s]
 34%|███▍      | 345/1000 [01:04<01:44,  6.24it/s]
 35%|███▍      | 347/1000 [01:05<01:23,  7.83it/s]
 35%|███▍      | 349/1000 [01:06<02:54,  3.73it/s]
 35%|███▌      | 353/1000 [01:06<01:39,  6.52it/s]
 36%|███▌      | 355/1000 [01:06<01:40,  6.44it/s]
 36%|███▌      | 357/1000 [01:07<01:51,  5.77it/s]
 36%|███▌      | 358/1000 [01:07<02:15,  4.72it/s]
 36%|███▋      | 363/1000 [01:07<01:13,  8.69it/s]
 36%|███▋      | 365/1000 [01:08<01:46,  5.95it/s]
 37%|███▋      | 367/1000 [01:08<02:11,  4.81it/s]
 37%|███▋      | 371/1000 [01:09<01:25,  7.32it/s]
 37%|███▋      | 373/1000 [01:09<01:42,  6.14it/s]
 38%|███▊      | 375/1000 [01:10<01:51,  5.61it/s]
 38%|███▊      | 376/1000 [01:10<02:05,  4.97it/s]
 38%|███▊      | 379/1000 [01:10<01:27,  7.07it/s]
 38%|███▊      | 381/1000 [01:10<01:14,  8.35it/s]
 38%|███▊      | 383/1000 [01:11<01:35,  6.47it/s]
 38%|███▊      | 385/1000 [01:11<01:50,  5.55it/s]
 39%|███▊      | 386/1000 [01:11<01:47,  5.70it/s]
 39%|███▉      | 388/1000 [01:11<01:30,  6.79it/s]
 39%|███▉      | 390/1000 [01:12<01:29,  6.81it/s]
 39%|███▉      | 391/1000 [01:12<01:31,  6.68it/s]
 39%|███▉      | 392/1000 [01:12<02:11,  4.61it/s]
 39%|███▉      | 394/1000 [01:13<01:34,  6.41it/s]
 40%|███▉      | 397/1000 [01:13<01:08,  8.80it/s]
 40%|███▉      | 399/1000 [01:13<01:01,  9.80it/s]
 40%|████      | 401/1000 [01:14<01:53,  5.26it/s]
 40%|████      | 403/1000 [01:14<01:31,  6.51it/s]
 40%|████      | 405/1000 [01:14<01:33,  6.36it/s]
 41%|████      | 406/1000 [01:14<01:33,  6.33it/s]
 41%|████      | 409/1000 [01:15<01:36,  6.12it/s]
 41%|████      | 410/1000 [01:15<02:10,  4.51it/s]
 41%|████      | 412/1000 [01:15<01:41,  5.77it/s]
 41%|████▏     | 414/1000 [01:16<01:26,  6.78it/s]
 42%|████▏     | 416/1000 [01:16<01:25,  6.80it/s]
 42%|████▏     | 418/1000 [01:16<01:40,  5.81it/s]
 42%|████▏     | 420/1000 [01:17<01:46,  5.45it/s]
 42%|████▏     | 424/1000 [01:17<01:07,  8.54it/s]
 43%|████▎     | 426/1000 [01:17<01:23,  6.85it/s]
 43%|████▎     | 428/1000 [01:18<01:46,  5.38it/s]
 43%|████▎     | 432/1000 [01:18<01:14,  7.59it/s]
 44%|████▎     | 435/1000 [01:19<01:11,  7.93it/s]
 44%|████▎     | 436/1000 [01:19<01:39,  5.64it/s]
 44%|████▎     | 437/1000 [01:19<01:39,  5.69it/s]
 44%|████▍     | 438/1000 [01:19<01:37,  5.75it/s]
 44%|████▍     | 440/1000 [01:20<01:21,  6.88it/s]
 44%|████▍     | 442/1000 [01:20<01:11,  7.84it/s]
 44%|████▍     | 443/1000 [01:20<02:02,  4.53it/s]
 44%|████▍     | 445/1000 [01:21<01:36,  5.77it/s]
 45%|████▍     | 447/1000 [01:21<01:19,  6.97it/s]
 45%|████▌     | 450/1000 [01:21<01:22,  6.67it/s]
 45%|████▌     | 451/1000 [01:22<01:38,  5.55it/s]
 45%|████▌     | 452/1000 [01:22<01:38,  5.59it/s]
 45%|████▌     | 453/1000 [01:22<01:38,  5.53it/s]
 45%|████▌     | 454/1000 [01:22<01:35,  5.70it/s]
 46%|████▌     | 456/1000 [01:22<01:12,  7.48it/s]
 46%|████▌     | 457/1000 [01:23<01:31,  5.90it/s]
 46%|████▌     | 459/1000 [01:23<01:43,  5.23it/s]
 46%|████▋     | 464/1000 [01:23<00:55,  9.66it/s]
 47%|████▋     | 466/1000 [01:24<01:25,  6.25it/s]
 47%|████▋     | 467/1000 [01:24<01:51,  4.77it/s]
 47%|████▋     | 469/1000 [01:25<01:33,  5.70it/s]
 47%|████▋     | 471/1000 [01:25<01:18,  6.77it/s]
 47%|████▋     | 474/1000 [01:26<01:45,  5.00it/s]
 48%|████▊     | 476/1000 [01:26<01:27,  6.00it/s]
 48%|████▊     | 478/1000 [01:26<01:14,  7.01it/s]
 48%|████▊     | 481/1000 [01:26<01:17,  6.66it/s]
 48%|████▊     | 482/1000 [01:27<01:33,  5.55it/s]
 48%|████▊     | 483/1000 [01:27<01:30,  5.69it/s]
 48%|████▊     | 484/1000 [01:27<01:29,  5.76it/s]
 49%|████▊     | 486/1000 [01:27<01:13,  6.98it/s]
 49%|████▊     | 487/1000 [01:27<01:13,  6.94it/s]
 49%|████▉     | 488/1000 [01:28<01:17,  6.64it/s]
 49%|████▉     | 489/1000 [01:28<01:21,  6.24it/s]
 49%|████▉     | 490/1000 [01:28<01:21,  6.27it/s]
 49%|████▉     | 491/1000 [01:28<02:01,  4.18it/s]
 50%|████▉     | 495/1000 [01:28<01:02,  8.12it/s]
 50%|████▉     | 497/1000 [01:29<01:22,  6.10it/s]
 50%|████▉     | 499/1000 [01:29<01:33,  5.35it/s]
 50%|█████     | 500/1000 [01:30<01:46,  4.68it/s]
 50%|█████     | 504/1000 [01:30<01:10,  7.03it/s]
 51%|█████     | 506/1000 [01:31<01:21,  6.05it/s]
 51%|█████     | 507/1000 [01:31<01:20,  6.16it/s]
 51%|█████     | 508/1000 [01:31<01:20,  6.08it/s]
 51%|█████     | 510/1000 [01:31<01:08,  7.17it/s]
 51%|█████     | 512/1000 [01:31<01:02,  7.76it/s]
 51%|█████▏    | 513/1000 [01:32<01:17,  6.29it/s]
 52%|█████▏    | 515/1000 [01:32<01:15,  6.39it/s]
 52%|█████▏    | 516/1000 [01:32<01:30,  5.32it/s]
 52%|█████▏    | 519/1000 [01:32<01:02,  7.64it/s]
 52%|█████▏    | 522/1000 [01:33<01:14,  6.44it/s]
 52%|█████▏    | 523/1000 [01:33<01:16,  6.25it/s]
 52%|█████▏    | 524/1000 [01:33<01:15,  6.30it/s]
 52%|█████▎    | 525/1000 [01:34<01:29,  5.31it/s]
 53%|█████▎    | 529/1000 [01:34<00:50,  9.33it/s]
 53%|█████▎    | 531/1000 [01:34<01:17,  6.03it/s]
 53%|█████▎    | 533/1000 [01:35<01:17,  6.06it/s]
 53%|█████▎    | 534/1000 [01:35<01:29,  5.18it/s]
 54%|█████▎    | 537/1000 [01:35<01:01,  7.53it/s]
 54%|█████▍    | 540/1000 [01:36<01:15,  6.11it/s]
 54%|█████▍    | 542/1000 [01:36<01:14,  6.14it/s]
 54%|█████▍    | 543/1000 [01:36<01:15,  6.02it/s]
 54%|█████▍    | 544/1000 [01:37<01:16,  5.96it/s]
 55%|█████▍    | 545/1000 [01:37<01:17,  5.90it/s]
 55%|█████▍    | 547/1000 [01:37<01:00,  7.46it/s]
 55%|█████▍    | 549/1000 [01:37<01:14,  6.02it/s]
 55%|█████▌    | 550/1000 [01:37<01:13,  6.13it/s]
 55%|█████▌    | 551/1000 [01:38<01:15,  5.97it/s]
 55%|█████▌    | 552/1000 [01:38<01:11,  6.24it/s]
 56%|█████▌    | 555/1000 [01:38<00:47,  9.42it/s]
 56%|█████▌    | 557/1000 [01:39<01:27,  5.09it/s]
 56%|█████▌    | 560/1000 [01:39<00:57,  7.62it/s]
 56%|█████▌    | 562/1000 [01:39<00:51,  8.57it/s]
 56%|█████▋    | 564/1000 [01:40<01:17,  5.65it/s]
 57%|█████▋    | 566/1000 [01:40<01:13,  5.93it/s]
 57%|█████▋    | 568/1000 [01:40<01:02,  6.90it/s]
 57%|█████▋    | 569/1000 [01:40<01:02,  6.84it/s]
 57%|█████▋    | 570/1000 [01:40<01:02,  6.93it/s]
 57%|█████▋    | 571/1000 [01:41<01:22,  5.20it/s]
 57%|█████▋    | 573/1000 [01:41<01:16,  5.56it/s]
 57%|█████▋    | 574/1000 [01:41<01:16,  5.54it/s]
 58%|█████▊    | 576/1000 [01:41<01:00,  6.97it/s]
 58%|█████▊    | 577/1000 [01:42<01:00,  6.96it/s]
 58%|█████▊    | 578/1000 [01:42<01:04,  6.54it/s]
 58%|█████▊    | 579/1000 [01:42<01:18,  5.38it/s]
 58%|█████▊    | 581/1000 [01:42<00:59,  7.04it/s]
 58%|█████▊    | 582/1000 [01:42<01:09,  6.05it/s]
 58%|█████▊    | 583/1000 [01:43<01:08,  6.13it/s]
 58%|█████▊    | 584/1000 [01:43<01:26,  4.82it/s]
 59%|█████▉    | 588/1000 [01:43<00:43,  9.52it/s]
 59%|█████▉    | 590/1000 [01:44<01:14,  5.49it/s]
 59%|█████▉    | 592/1000 [01:44<01:11,  5.67it/s]
 59%|█████▉    | 593/1000 [01:44<01:10,  5.77it/s]
 59%|█████▉    | 594/1000 [01:44<01:08,  5.89it/s]
 60%|█████▉    | 596/1000 [01:45<00:56,  7.14it/s]
 60%|█████▉    | 598/1000 [01:45<00:58,  6.85it/s]
 60%|█████▉    | 599/1000 [01:45<01:01,  6.57it/s]
 60%|██████    | 600/1000 [01:46<01:27,  4.57it/s]
 60%|██████    | 602/1000 [01:46<01:06,  5.98it/s]
 60%|██████    | 604/1000 [01:46<00:54,  7.27it/s]
 61%|██████    | 606/1000 [01:46<00:46,  8.48it/s]
 61%|██████    | 607/1000 [01:47<01:11,  5.48it/s]
 61%|██████    | 608/1000 [01:47<01:11,  5.47it/s]
 61%|██████    | 609/1000 [01:47<01:11,  5.50it/s]
 61%|██████    | 610/1000 [01:47<01:08,  5.70it/s]
 61%|██████    | 611/1000 [01:47<01:05,  5.93it/s]
 61%|██████▏   | 613/1000 [01:47<00:52,  7.31it/s]
 61%|██████▏   | 614/1000 [01:48<00:52,  7.32it/s]
 62%|██████▏   | 615/1000 [01:48<00:54,  7.06it/s]
 62%|██████▏   | 616/1000 [01:48<01:08,  5.58it/s]
 62%|██████▏   | 618/1000 [01:48<00:51,  7.40it/s]
 62%|██████▏   | 619/1000 [01:48<01:09,  5.45it/s]
 62%|██████▏   | 620/1000 [01:49<01:06,  5.68it/s]
 62%|██████▏   | 623/1000 [01:49<00:43,  8.60it/s]
 62%|██████▏   | 624/1000 [01:49<01:12,  5.19it/s]
 63%|██████▎   | 626/1000 [01:49<00:58,  6.42it/s]
 63%|██████▎   | 628/1000 [01:50<01:23,  4.47it/s]
 63%|██████▎   | 633/1000 [01:50<00:49,  7.42it/s]
 64%|██████▎   | 635/1000 [01:51<00:53,  6.84it/s]
 64%|██████▎   | 636/1000 [01:51<01:01,  5.90it/s]
 64%|██████▎   | 637/1000 [01:51<01:03,  5.73it/s]
 64%|██████▍   | 638/1000 [01:52<01:12,  4.97it/s]
 64%|██████▍   | 643/1000 [01:52<00:37,  9.47it/s]
 64%|██████▍   | 645/1000 [01:53<01:02,  5.64it/s]
 65%|██████▍   | 646/1000 [01:53<01:01,  5.78it/s]
 65%|██████▍   | 647/1000 [01:53<01:02,  5.66it/s]
 65%|██████▍   | 649/1000 [01:53<00:50,  6.93it/s]
 65%|██████▌   | 650/1000 [01:53<00:51,  6.82it/s]
 65%|██████▌   | 651/1000 [01:53<00:52,  6.65it/s]
 65%|██████▌   | 652/1000 [01:54<01:07,  5.19it/s]
 65%|██████▌   | 653/1000 [01:54<01:02,  5.53it/s]
 65%|██████▌   | 654/1000 [01:54<01:02,  5.54it/s]
 66%|██████▌   | 656/1000 [01:54<00:59,  5.81it/s]
 66%|██████▌   | 657/1000 [01:55<00:59,  5.77it/s]
 66%|██████▌   | 658/1000 [01:55<00:57,  5.95it/s]
 66%|██████▌   | 660/1000 [01:55<00:45,  7.54it/s]
 66%|██████▌   | 662/1000 [01:55<00:47,  7.07it/s]
 66%|██████▋   | 663/1000 [01:56<00:59,  5.70it/s]
 66%|██████▋   | 664/1000 [01:56<00:59,  5.62it/s]
 66%|██████▋   | 665/1000 [01:56<01:00,  5.50it/s]
 67%|██████▋   | 667/1000 [01:56<00:47,  7.06it/s]
 67%|██████▋   | 670/1000 [01:57<01:08,  4.85it/s]
 67%|██████▋   | 672/1000 [01:57<00:54,  6.06it/s]
 68%|██████▊   | 675/1000 [01:57<00:40,  8.08it/s]
 68%|██████▊   | 677/1000 [01:58<00:58,  5.55it/s]
 68%|██████▊   | 679/1000 [01:58<00:49,  6.55it/s]
 68%|██████▊   | 680/1000 [01:58<00:57,  5.52it/s]
 68%|██████▊   | 681/1000 [01:59<00:55,  5.71it/s]
 68%|██████▊   | 682/1000 [01:59<00:56,  5.60it/s]
 68%|██████▊   | 683/1000 [01:59<00:56,  5.61it/s]
 68%|██████▊   | 685/1000 [01:59<00:43,  7.29it/s]
 69%|██████▉   | 688/1000 [01:59<00:41,  7.49it/s]
 69%|██████▉   | 689/1000 [02:00<01:02,  5.01it/s]
 69%|██████▉   | 694/1000 [02:00<00:32,  9.49it/s]
 70%|██████▉   | 696/1000 [02:01<00:49,  6.11it/s]
 70%|██████▉   | 698/1000 [02:01<00:56,  5.30it/s]
 70%|██████▉   | 699/1000 [02:02<01:02,  4.85it/s]
 70%|███████   | 704/1000 [02:02<00:34,  8.65it/s]
 71%|███████   | 706/1000 [02:03<00:56,  5.24it/s]
 71%|███████   | 709/1000 [02:03<00:41,  6.96it/s]
 71%|███████   | 712/1000 [02:03<00:47,  6.06it/s]
 71%|███████▏  | 714/1000 [02:04<00:48,  5.84it/s]
 72%|███████▏  | 715/1000 [02:04<00:49,  5.75it/s]
 72%|███████▏  | 716/1000 [02:04<00:47,  5.99it/s]
 72%|███████▏  | 718/1000 [02:04<00:39,  7.06it/s]
 72%|███████▏  | 719/1000 [02:04<00:38,  7.35it/s]
 72%|███████▏  | 720/1000 [02:05<00:39,  7.06it/s]
 72%|███████▏  | 721/1000 [02:05<00:51,  5.44it/s]
 72%|███████▏  | 722/1000 [02:05<00:49,  5.66it/s]
 72%|███████▏  | 723/1000 [02:05<00:47,  5.80it/s]
 72%|███████▏  | 724/1000 [02:05<00:45,  6.04it/s]
 73%|███████▎  | 727/1000 [02:06<00:28,  9.68it/s]
 73%|███████▎  | 729/1000 [02:06<00:46,  5.84it/s]
 73%|███████▎  | 730/1000 [02:06<00:45,  5.97it/s]
 73%|███████▎  | 732/1000 [02:07<00:43,  6.18it/s]
 73%|███████▎  | 733/1000 [02:07<00:43,  6.20it/s]
 74%|███████▎  | 736/1000 [02:07<00:32,  8.14it/s]
 74%|███████▎  | 737/1000 [02:07<00:34,  7.64it/s]
 74%|███████▍  | 738/1000 [02:08<00:46,  5.65it/s]
 74%|███████▍  | 739/1000 [02:08<00:46,  5.62it/s]
 74%|███████▍  | 740/1000 [02:08<00:44,  5.84it/s]
 74%|███████▍  | 741/1000 [02:08<00:42,  6.10it/s]
 74%|███████▍  | 743/1000 [02:08<00:40,  6.33it/s]
 74%|███████▍  | 744/1000 [02:08<00:39,  6.42it/s]
 75%|███████▍  | 746/1000 [02:09<00:30,  8.20it/s]
 75%|███████▍  | 747/1000 [02:09<00:32,  7.84it/s]
 75%|███████▍  | 748/1000 [02:09<00:33,  7.42it/s]
 75%|███████▍  | 749/1000 [02:09<00:46,  5.42it/s]
 75%|███████▌  | 751/1000 [02:09<00:34,  7.30it/s]
 75%|███████▌  | 752/1000 [02:10<00:45,  5.45it/s]
 75%|███████▌  | 753/1000 [02:10<00:43,  5.70it/s]
 75%|███████▌  | 754/1000 [02:10<00:38,  6.34it/s]
 76%|███████▌  | 756/1000 [02:10<00:38,  6.36it/s]
 76%|███████▌  | 757/1000 [02:10<00:37,  6.48it/s]
 76%|███████▌  | 759/1000 [02:11<00:37,  6.38it/s]
 76%|███████▌  | 760/1000 [02:11<00:38,  6.18it/s]
 76%|███████▌  | 761/1000 [02:11<00:39,  6.04it/s]
 76%|███████▋  | 763/1000 [02:11<00:30,  7.79it/s]
 76%|███████▋  | 765/1000 [02:12<00:32,  7.18it/s]
 77%|███████▋  | 767/1000 [02:12<00:33,  6.97it/s]
 77%|███████▋  | 768/1000 [02:12<00:39,  5.82it/s]
 77%|███████▋  | 769/1000 [02:12<00:39,  5.79it/s]
 77%|███████▋  | 772/1000 [02:13<00:26,  8.69it/s]
 77%|███████▋  | 773/1000 [02:13<00:42,  5.33it/s]
 78%|███████▊  | 775/1000 [02:14<00:46,  4.80it/s]
 78%|███████▊  | 777/1000 [02:14<00:36,  6.11it/s]
 78%|███████▊  | 779/1000 [02:14<00:29,  7.47it/s]
 78%|███████▊  | 781/1000 [02:14<00:25,  8.55it/s]
 78%|███████▊  | 783/1000 [02:14<00:28,  7.72it/s]
 78%|███████▊  | 784/1000 [02:15<00:41,  5.23it/s]
 78%|███████▊  | 785/1000 [02:15<00:39,  5.45it/s]
 79%|███████▊  | 786/1000 [02:15<00:38,  5.59it/s]
 79%|███████▉  | 789/1000 [02:15<00:24,  8.58it/s]
 79%|███████▉  | 791/1000 [02:16<00:40,  5.12it/s]
 79%|███████▉  | 792/1000 [02:16<00:39,  5.32it/s]
 79%|███████▉  | 793/1000 [02:16<00:38,  5.41it/s]
 79%|███████▉  | 794/1000 [02:16<00:36,  5.70it/s]
 80%|███████▉  | 798/1000 [02:17<00:24,  8.38it/s]
 80%|███████▉  | 799/1000 [02:17<00:31,  6.34it/s]
 80%|████████  | 800/1000 [02:18<00:42,  4.72it/s]
 80%|████████  | 804/1000 [02:18<00:23,  8.21it/s]
 81%|████████  | 806/1000 [02:18<00:21,  9.08it/s]
 81%|████████  | 808/1000 [02:19<00:36,  5.30it/s]
 81%|████████  | 809/1000 [02:19<00:35,  5.40it/s]
 81%|████████  | 810/1000 [02:19<00:34,  5.45it/s]
 81%|████████  | 812/1000 [02:19<00:28,  6.63it/s]
 81%|████████▏ | 814/1000 [02:19<00:23,  7.83it/s]
 82%|████████▏ | 815/1000 [02:20<00:31,  5.87it/s]
 82%|████████▏ | 816/1000 [02:20<00:38,  4.84it/s]
 82%|████████▏ | 817/1000 [02:20<00:35,  5.16it/s]
 82%|████████▏ | 818/1000 [02:20<00:33,  5.37it/s]
 82%|████████▏ | 820/1000 [02:20<00:25,  7.15it/s]
 82%|████████▏ | 821/1000 [02:21<00:25,  7.06it/s]
 82%|████████▏ | 822/1000 [02:21<00:24,  7.12it/s]
 82%|████████▏ | 823/1000 [02:21<00:33,  5.21it/s]
 82%|████████▎ | 825/1000 [02:21<00:30,  5.69it/s]
 83%|████████▎ | 826/1000 [02:22<00:29,  5.86it/s]
 83%|████████▎ | 828/1000 [02:22<00:24,  7.14it/s]
 83%|████████▎ | 829/1000 [02:22<00:23,  7.14it/s]
 83%|████████▎ | 830/1000 [02:22<00:39,  4.26it/s]
 83%|████████▎ | 834/1000 [02:23<00:20,  8.28it/s]
 84%|████████▎ | 836/1000 [02:23<00:32,  5.01it/s]
 84%|████████▍ | 842/1000 [02:24<00:21,  7.27it/s]
 84%|████████▍ | 843/1000 [02:24<00:30,  5.14it/s]
 85%|████████▍ | 848/1000 [02:25<00:18,  8.21it/s]
 85%|████████▌ | 850/1000 [02:25<00:24,  6.00it/s]
 85%|████████▌ | 852/1000 [02:26<00:26,  5.60it/s]
 85%|████████▌ | 853/1000 [02:26<00:25,  5.71it/s]
 86%|████████▌ | 855/1000 [02:26<00:21,  6.88it/s]
 86%|████████▌ | 856/1000 [02:26<00:20,  7.09it/s]
 86%|████████▌ | 858/1000 [02:27<00:27,  5.18it/s]
 86%|████████▌ | 862/1000 [02:27<00:17,  7.90it/s]
 86%|████████▋ | 865/1000 [02:27<00:16,  8.00it/s]
 87%|████████▋ | 866/1000 [02:28<00:20,  6.42it/s]
 87%|████████▋ | 867/1000 [02:28<00:27,  4.77it/s]
 87%|████████▋ | 870/1000 [02:29<00:21,  5.93it/s]
 87%|████████▋ | 871/1000 [02:29<00:21,  6.06it/s]
 87%|████████▋ | 873/1000 [02:29<00:17,  7.08it/s]
 88%|████████▊ | 875/1000 [02:29<00:15,  8.08it/s]
 88%|████████▊ | 876/1000 [02:30<00:27,  4.54it/s]
 88%|████████▊ | 878/1000 [02:30<00:20,  5.83it/s]
 88%|████████▊ | 880/1000 [02:30<00:17,  7.00it/s]
 88%|████████▊ | 882/1000 [02:30<00:14,  8.37it/s]
 88%|████████▊ | 884/1000 [02:31<00:22,  5.27it/s]
 88%|████████▊ | 885/1000 [02:31<00:21,  5.41it/s]
 89%|████████▊ | 886/1000 [02:31<00:20,  5.69it/s]
 89%|████████▉ | 888/1000 [02:32<00:22,  4.98it/s]
 89%|████████▉ | 891/1000 [02:32<00:15,  7.16it/s]
 89%|████████▉ | 892/1000 [02:32<00:14,  7.26it/s]
 89%|████████▉ | 894/1000 [02:32<00:15,  7.00it/s]
 90%|████████▉ | 895/1000 [02:32<00:14,  7.02it/s]
 90%|████████▉ | 896/1000 [02:33<00:22,  4.65it/s]
 90%|█████████ | 901/1000 [02:33<00:10,  9.13it/s]
 90%|█████████ | 903/1000 [02:34<00:14,  6.82it/s]
 90%|█████████ | 904/1000 [02:34<00:16,  5.87it/s]
 90%|█████████ | 905/1000 [02:34<00:18,  5.11it/s]
 91%|█████████ | 906/1000 [02:34<00:17,  5.26it/s]
 91%|█████████ | 907/1000 [02:35<00:17,  5.27it/s]
 91%|█████████ | 908/1000 [02:35<00:17,  5.39it/s]
 91%|█████████ | 909/1000 [02:35<00:16,  5.59it/s]
 91%|█████████ | 910/1000 [02:35<00:15,  5.87it/s]
 91%|█████████ | 912/1000 [02:35<00:11,  7.70it/s]
 91%|█████████▏| 914/1000 [02:36<00:12,  6.98it/s]
 92%|█████████▏| 916/1000 [02:36<00:17,  4.85it/s]
 92%|█████████▏| 921/1000 [02:36<00:08,  9.07it/s]
 92%|█████████▏| 923/1000 [02:37<00:13,  5.52it/s]
 92%|█████████▏| 924/1000 [02:37<00:13,  5.62it/s]
 92%|█████████▎| 925/1000 [02:37<00:13,  5.62it/s]
 93%|█████████▎| 926/1000 [02:38<00:12,  5.80it/s]
 93%|█████████▎| 929/1000 [02:38<00:08,  8.67it/s]
 93%|█████████▎| 931/1000 [02:39<00:14,  4.86it/s]
 94%|█████████▎| 935/1000 [02:39<00:09,  6.87it/s]
 94%|█████████▎| 937/1000 [02:39<00:09,  6.45it/s]
 94%|█████████▍| 939/1000 [02:40<00:09,  6.41it/s]
100%|█████████▉| 997/1000 [02:40<00:00, 64.04it/s]
100%|██████████| 1000/1000 [02:40<00:00,  6.23it/s]

============ Serving Benchmark Result ============
Backend:                                 sglang    
Traffic request rate:                    inf       
Max request concurrency:                 64        
Successful requests:                     1000      
Benchmark duration (s):                  160.54    
Total input tokens:                      90000000  
Total input text tokens:                 90000000  
Total generated tokens:                  1000      
Total generated tokens (retokenized):    1000      
Request throughput (req/s):              6.23      
Input token throughput (tok/s):          560598.05 
Output token throughput (tok/s):         6.23      
Peak output token throughput (tok/s):    62.00     
Peak concurrent requests:                73        
Total token throughput (tok/s):          560604.28 
Concurrency:                             63.80     
Accept length:                           3.87      
----------------End-to-End Latency----------------
Mean E2E Latency (ms):                   10243.30  
Median E2E Latency (ms):                 10246.51  
P90 E2E Latency (ms):                    10713.14  
P99 E2E Latency (ms):                    18597.84  
---------------Time to First Token----------------
Mean TTFT (ms):                          10243.29  
Median TTFT (ms):                        10246.50  
P99 TTFT (ms):                           18597.83  
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          0.00      
Median TPOT (ms):                        0.00      
P99 TPOT (ms):                           0.00      
---------------Inter-Token Latency----------------
Mean ITL (ms):                           0.00      
Median ITL (ms):                         0.00      
P95 ITL (ms):                            0.00      
P99 ITL (ms):                            0.00      
Max ITL (ms):                            0.00      
==================================================